In [2]:
import pandas as pd
import numpy as np

In [7]:
a = pd.Series(np.arange(4), index=['a', 'c', 'd', 'e'])
print(a)
b= pd.Series(np.arange(6), index=['a', 'b', 'c', 'd', 'e', 'f'])
print(b)

a    0
c    1
d    2
e    3
dtype: int64
a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [8]:
a + b

a    0.0
b    NaN
c    3.0
d    5.0
e    7.0
f    NaN
dtype: float64

In [10]:
df = pd.DataFrame(np.arange(9).reshape(3,3),index=['ohio', 'texas', 'colorado'], columns=['b', 'c', 'd'])
df

          b  c  d
ohio      0  1  2
texas     3  4  5
colorado  6  7  8

In [11]:
df1 = pd.DataFrame(np.arange(12).reshape(4,3),index=['utah','ohio', 'texas', 'overgon'], columns=['b', 'd', 'e'])
df1

         b   d   e
utah     0   1   2
ohio     3   4   5
texas    6   7   8
overgon  9  10  11

In [12]:
df + df1

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
overgon   NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [16]:
df_a = pd.DataFrame([1,2],columns=['a'])
df_b = pd.DataFrame([3,4],columns=['b'])
df_a + df_b

    a   b
0 NaN NaN
1 NaN NaN

In [20]:
df.add(df1, fill_value=0)

            b    c     d     e
colorado  6.0  7.0   8.0   NaN
ohio      3.0  1.0   6.0   5.0
overgon   9.0  NaN  10.0  11.0
texas     9.0  4.0  12.0   8.0
utah      0.0  NaN   1.0   2.0